Autodesk.Revit.DB.GridNode.VIndex
The node's index along the V axis.

Autodesk.Revit.DB.GridNode.UIndex
The node's index along the U axis.

Autodesk.Revit.DB.GridNode
A structure that represents a particular location in (U,V) from a grid.